---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussBadTransformation
source: html/671ef31b-9475-30e0-dc03-cf33b4cf3e8c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TrussFailures.TrussBadTransformation Property

Revit cannot transform the truss Layout Family to the Truss as oriented in the project.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrussBadTransformation { get; }
```